[
  {
    "id": 1,
    "title": "TechFest 2025",
    "date": "2025-07-20",
    "startTime": "10:00",
    "endTime": "16:00",
    "category": "Academic",
    "department": "Computer Science",
    "venue": "Main Auditorium, Block A",
    "organizer": "CS Department",
    "shortDescription": "Hackathons, seminars, expo.",
    "description": "Biggest tech event of the year with hackathons, seminars, and competitions.",
    "longDescription": "TechFest brings together students, alumni, mentors and industry leaders for a full day of hands-on learning and friendly competition. Morning tracks feature rapid-fire talks on AI, systems, and security, followed by guided labs where you’ll build a working prototype from scratch. Teams can participate in the flagship hackathon with themed prompts around education, health, and sustainability; mentors will be available through the day for code reviews and product feedback. Alongside the hack floor, the expo showcases student startups and capstone projects—expect demos, hardware rigs, and plenty of inspiration. The afternoon closes with lightning talks by invited speakers and prize announcements. Whether you code, design, or just love tech, there’s a space for you at TechFest.",
    "image1": "/images/events/tech-fest-one.png",
    "image2": "/images/events/tech-fest-two.png",
    "image3": "/images/events/tech-fest-three.png",
    "image4": "/images/events/tech-fest-four.png",
    "location": "Main Auditorium, Block A"
  },
  {
    "id": 2,
    "title": "Cultural Week",
    "date": "2025-08-05",
    "startTime": "11:00",
    "endTime": "18:00",
    "category": "Cultural",
    "department": "Arts",
    "venue": "Open Air Theatre",
    "organizer": "Arts Society",
    "shortDescription": "Performances, exhibits and food fests.",
    "description": "Celebrate diversity with performances, exhibitions, and food fests.",
    "longDescription": "Cultural Week is a campus-wide celebration of music, dance, theatre and crafts from across the student community. Each afternoon opens with pop-up showcases and interactive workshops—learn a folk step, try a drum pattern, or paint a traditional motif with guidance from student artists. Stalls curated by clubs present textiles, handmade accessories and zines. Evenings come alive on the main stage with curated sets blending classical, contemporary, and fusion performances. The food boulevard runs throughout, featuring regional favorites and student-run pop-ups. Join the community mural, contribute to the open-mic poetry circle, and close the week with a collaborative finale featuring artists from multiple societies.",
    "image1": "/images/events/cultural-week-one.png",
    "image2": "/images/events/cultural-week-two.png",
    "image3": "/images/events/cultural-week-three.png",
    "image4": "/images/events/cultural-week-four.png",
    "location": "Open Air Theatre"
  },
  {
    "id": 3,
    "title": "Sports Gala",
    "date": "2025-09-15",
    "startTime": "08:00",
    "endTime": "17:00",
    "category": "Sports",
    "department": "Physical Education",
    "venue": "College Ground",
    "organizer": "Sports Committee",
    "shortDescription": "Inter-department matches and activities.",
    "description": "Annual sports gala with inter-department matches and activities.",
    "longDescription": "The Sports Gala is our biggest day of athletic spirit, bringing together departments for friendly yet competitive fixtures. The morning begins with track events and skill challenges, followed by league matches in football, cricket and volleyball. Fitness corners offer mini-clinics on warm-ups, mobility, and recovery with our PE coaches. Spectators can join open challenges like penalty shootouts and three-point contests. The closing ceremony recognizes MVPs, best cheering squad, and fair-play awards. Bring your water bottles, sunscreen, and loudest cheers—this is a day for the whole campus to move together.",
    "image1": "/images/events/tech-fest-one.png",
    "image2": "/images/events/tech-fest-two.png",
    "image3": "/images/events/tech-fest-three.png",
    "image4": "/images/events/tech-fest-four.png",
    "location": "College Ground"
  },
  {
    "id": 4,
    "title": "Data Science Workshop",
    "date": "2025-10-10",
    "startTime": "10:00",
    "endTime": "13:00",
    "category": "Academic",
    "department": "Computer Science",
    "venue": "Lab 302",
    "organizer": "AI Club",
    "shortDescription": "Hands-on intro to ML & Python.",
    "description": "A beginner friendly hands-on workshop covering data analysis and ML in Python.",
    "longDescription": "A practical introduction to the data science workflow using Python. We’ll start with notebooks and data wrangling using pandas, explore visualization techniques, and build your first classification model with a clean train/validation split. You’ll learn to reason about metrics, avoid common pitfalls like leakage, and document your work for reproducibility. The session concludes with an optional challenge using a real-world dataset and a short showcase of participant solutions. No prior ML experience required—basic Python familiarity is enough. Laptops required; limited lab machines are available on a first-come basis.",
    "image1": "/images/events/data-science-workshop-one.png",
    "image2": "/images/events/data-science-workshop-two.png",
    "image3": "/images/events/data-science-workshop-three.png",
    "image4": "/images/events/data-science-workshop-four.png",
    "location": "Lab 302"
  },
  {
    "id": 5,
    "title": "Drama Night",
    "date": "2025-11-05",
    "startTime": "18:30",
    "endTime": "21:00",
    "category": "Cultural",
    "department": "Arts",
    "venue": "Black Box Theatre",
    "organizer": "Dramatics Club",
    "shortDescription": "One-act plays by student groups.",
    "description": "An evening of award-winning one-act plays by the Dramatics Club.",
    "longDescription": "Drama Night features three tightly produced one-act plays spanning comedy, realism, and experimental theatre. Student directors lead small ensembles through intimate stories, supported by original set and light design built in-house. A short post-show interaction invites the audience to discuss themes and staging choices with the cast and crew. Entry is free but seating is limited—arrive early to secure a good spot. If you’re interested in backstage roles, look out for the volunteer desk in the foyer.",
    "image1": "/images/events/drama-night-one.png",
    "image2": "/images/events/drama-night-two.png",
    "image3": "/images/events/drama-night-three.png",
    "image4": "/images/events/drama-night-four.png",
    "location": "Black Box Theatre"
  },
  {
    "id": 6,
    "title": "Startup Showcase",
    "date": "2025-08-25",
    "startTime": "14:00",
    "endTime": "17:00",
    "category": "Departmental",
    "department": "Management",
    "venue": "Innovation Hall",
    "organizer": "E-Cell",
    "shortDescription": "Pitch day for prestige student founders.",
    "description": "Student startup pitches, mentor sessions and networking.",
    "longDescription": "A curated demo day spotlighting student-founded ventures at pre-prototype to early traction stages. Teams present five-minute pitches followed by expert Q&A from alumni founders and investors. Between sessions, explore product tables, sign up for office hours with mentors, and connect with peers looking for co-founders. Tracks include SaaS, climate, creator tools and campus utilities. The event closes with feedback summaries and meet-and-greet clusters organized by interest area. Open to all disciplines; non-founders are welcome to attend and learn.",
    "image1": "/images/events/tech-fest-two.png",
    "image2": "/images/events/tech-fest-one.png",
    "image3": "/images/events/tech-fest-three.png",
    "image4": "/images/events/tech-fest-four.png",
    "location": "Innovation Hall"
  },
  {
    "id": 7,
    "title": "Inter-College Football",
    "date": "2025-10-02",
    "startTime": "16:00",
    "endTime": "21:00",
    "category": "Sports",
    "department": "Physical Education",
    "venue": "North Ground",
    "organizer": "Sports Council",
    "shortDescription": "Knockout tournament under lights.",
    "description": "Fast-paced and challenging inter-college football knockout tournament.",
    "longDescription": "An evening knockout featuring invited college teams playing under lights. The format packs drama into short, high-intensity fixtures with golden-goal rules in late rounds. Off the pitch, the fan zone offers commentary, face painting and refreshments. Professional referees and a certified first-aid team are on duty. Bring your banners and support your side—finals kick off around 20:00 with a trophy presentation on the pitch.",
    "image1": "/images/events/inter-college-football-one.png",
    "image2": "/images/events/inter-college-football-two.png",
    "image3": "/images/events/inter-college-football-three.png",
    "image4": "/images/events/inter-college-football-four.png",
    "location": "North Ground"
  },
  {
    "id": 8,
    "title": "Photography Walk",
    "date": "2025-09-05",
    "startTime": "07:00",
    "endTime": "10:00",
    "category": "Departmental",
    "department": "Media Arts",
    "venue": "Campus Central",
    "organizer": "Media Club",
    "shortDescription": "Composition, light and street portraits.",
    "description": "Learn composition, lighting and storytelling while walking across campus.",
    "longDescription": "A slow-paced walk at golden hour led by senior club mentors. We’ll cover framing, using natural reflectors, and telling a story through a three-photo series. Beginners can borrow limited club gear; phone photographers are encouraged. Expect brief pauses for mini-assignments and feedback. Wear comfortable shoes, carry water, and keep your kit lightweight. Selected photos will be featured on the club page after a community review.",
    "image1": "/images/events/photography-walk-one.png",
    "image2": "/images/events/photography-walk-two.png",
    "image3": "/images/events/photography-walk-three.png",
    "image4": "/images/events/photography-walk-four.png",
    "location": "Campus Central"
  },
  {
    "id": 9,
    "title": "Coding League Round 1",
    "date": "2025-08-18",
    "startTime": "11:00",
    "endTime": "13:00",
    "category": "Academic",
    "department": "Computer Science",
    "venue": "Lab 201",
    "organizer": "Coding Club",
    "shortDescription": "Algorithmic challenges for teams.",
    "description": "A timed algorithmic contest for teams of two.",
    "longDescription": "Round 1 of the Coding League features three algorithmic problems designed to test fundamentals: data structures, greedy reasoning, and dynamic programming. Teams of two will compete on a live judge with partial scoring and public leaderboards. Bring your student ID; solutions in C++, Java, and Python are accepted. After the session, mentors will walk through editorial solutions and common pitfalls to help you prepare for Round 2.",
    "image1": "/images/events/coding-league-one.png",
    "image2": "/images/events/coding-league-two.png",
    "image3": "/images/events/coding-league-three.png",
    "image4": "/images/events/coding-league-four.png",
    "location": "Lab 201"
  },
  {
    "id": 10,
    "title": "TEDx Campus",
    "date": "2025-12-01",
    "startTime": "10:00",
    "endTime": "16:00",
    "category": "Departmental",
    "department": "Management",
    "venue": "Convention Centre",
    "organizer": "Oratory Club",
    "shortDescription": "Talks from innovators & alumni.",
    "description": "A lineup of inspiring talks from innovators, alumni and faculty.",
    "longDescription": "An independently organized TEDx with a theme centered on possibility and progress. Speakers include alumni founders, researchers, and creators who will share concise, high-impact stories. Between sessions, explore interactive installations, a quiet note wall for reflections, and a bookstore corner featuring recommended reads. Seating is theatre-style with scheduled breaks. Tickets will be scanned at entry; please arrive 20 minutes early for check-in.",
    "image1": "/images/events/TEDx-campus-one.png",
    "image2": "/images/events/TEDx-campus-two.png",
    "image3": "/images/events/TEDx-campus-three.png",
    "image4": "/images/events/TEDx-campus-four.png",
    "location": "Convention Centre"
  },
  {
    "id": 11,
    "title": "Career Fair",
    "date": "2025-03-27",
    "startTime": "09:00",
    "endTime": "16:00",
    "category": "Departmental",
    "department": "Training & Placement",
    "venue": "Expo Hall",
    "organizer": "TPO",
    "shortDescription": "Meet recruiters; resume clinic and mock interviews.",
    "description": "Explore internships and full-time roles; attend resume reviews & mock interviews.",
    "longDescription": "Meet recruiters from technology, consulting, manufacturing, and fast-growing startups. Start with the orientation desk to pick up your floor map and quick-prep checklist. Resume doctors will help you tighten bullets and quantify impact, while mock interviews run every hour on a sign-up basis. Attend short employer spotlights to learn what teams are hiring for and how to stand out. Dress smart casual, carry multiple resume copies, and be ready with a concise elevator pitch.",
    "image1": "/images/events/career-fair-drive-one.png",
    "image2": "/images/events/career-fair-drive-two.png",
    "image3": "/images/events/career-fair-drive-three.png",
    "image4": "/images/events/career-fair-drive-four.png",
    "location": "Expo Hall"
  },
  {
    "id": 12,
    "title": "Project Exhibit",
    "date": "2024-04-10",
    "startTime": "09:30",
    "endTime": "14:00",
    "category": "Academic",
    "department": "Electronics",
    "venue": "Innovation Hall",
    "organizer": "Dept. of Electronics",
    "shortDescription": "Students showcase semester projects.",
    "description": "Prototype demos and poster sessions with industry judges.",
    "longDescription": "A juried exhibition of semester projects across embedded systems, IoT, and robotics. Each team presents a working prototype and a concise poster explaining design choices, testing results, and future improvements. Industry judges circulate for structured evaluations, and a public hour invites visitors to try demos hands-on. The exhibit is a great opportunity to find collaborators, mentors, and inspiration for your next build.",
    "image1": "/images/events/exhibit-college-one.png",
    "image2": "/images/events/exhibit-college-two.png",
    "image3": "/images/events/exhibit-college-three.png",
    "image4": "/images/events/exhibit-college-four.png",
    "location": "Innovation Hall"
  },
  {
    "id": 13,
    "title": "Robotics Championship",
    "date": "2025-10-12",
    "startTime": "09:00",
    "endTime": "16:00",
    "category": "Academic",
    "department": "Robotics",
    "venue": "Innovation Arena",
    "organizer": "Robotics Club",
    "shortDescription": "Line follower, sumo bot, maze solver.",
    "description": "Multiple robotics leagues with exciting finals.",
    "longDescription": "A multi-league tournament featuring line-followers, mini-sumo, and autonomous maze-solvers. Teams can register for one or more categories; scrutineering begins at 08:00 to verify dimensions and safety. Practice lanes are available throughout the day. Expect head-to-head bouts, knockout brackets, and a crowd-pleasing finale. Bring spare batteries and tools—pit tables are provided on a shared basis.",
    "image1": "/images/events/robotics-championship-one.png",
    "image2": "/images/events/robotics-championship-two.png",
    "image3": "/images/events/robotics-championship-three.png",
    "image4": "/images/events/robotics-championship-four.png",
    "location": "Innovation Arena"
  },
  {
    "id": 14,
    "title": "Blood Donation Drive",
    "date": "2025-05-14",
    "startTime": "09:00",
    "endTime": "15:00",
    "category": "Departmental",
    "department": "NSS Unit",
    "venue": "Health Center",
    "organizer": "NSS",
    "shortDescription": "Support the city blood bank for better good.",
    "description": "Partnered with city hospital; donors get wellness checks.",
    "longDescription": "Donate blood to support the city hospital’s emergency reserves. All donors undergo a quick eligibility screening and basic wellness check including hemoglobin and blood pressure. The process is safe, hygienic, and supervised by certified professionals. Healthy snacks and hydration are provided post-donation along with certificates of appreciation. Even if you’re not eligible to donate, volunteer roles are open for registration and hospitality.",
    "image1": "/images/events/blood-donation-drive-one.png",
    "image2": "/images/events/blood-donation-drive-two.png",
    "image3": "/images/events/blood-donation-drive-three.png",
    "image4": "/images/events/blood-donation-drive-four.png",
    "location": "Health Center"
  },
  {
    "id": 15,
    "title": "Alumni Meet",
    "date": "2025-12-07",
    "startTime": "10:00",
    "endTime": "14:00",
    "category": "Departmental",
    "department": "Alumni Office",
    "venue": "Convention Centre",
    "organizer": "Alumni Cell",
    "shortDescription": "Reconnect with alumni and explore mentorships.",
    "description": "Networking with alumni, panel discussions, and campus tours.",
    "longDescription": "A warm homecoming for graduates across batches with space for reconnection and mentorship. The morning opens with a keynote and a moderated panel on industry trends, followed by guided networking circles grouped by domain. A mentorship sign-up desk pairs students with willing alumni for monthly check-ins. Campus tours run every hour for those revisiting after many years. Family members are welcome; light lunch will be served.",
    "image1": "/images/events/alumni-meet-one.png",
    "image2": "/images/events/alumni-meet-two.png",
    "image3": "/images/events/alumni-meet-three.png",
    "image4": "/images/events/alumni-meet-four.png",
    "location": "Convention Centre"
  },
  {
    "id": 16,
    "title": "Music Night",
    "date": "2025-02-17",
    "startTime": "18:00",
    "endTime": "21:30",
    "category": "Cultural",
    "department": "Music Club",
    "venue": "Amphi Theatre",
    "organizer": "Music Club",
    "shortDescription": "Band performances and open-mic.",
    "description": "Showcase of campus bands and open-mic performances.",
    "longDescription": "An open-air concert featuring campus bands across indie, rock, and acoustic sets, followed by an open-mic segment for solo performers and duos. Basic backline is provided—guitars, keyboards, and percussion welcome. Sign-ups for open-mic open at 17:00 near the sound console. Expect a relaxed vibe, fairy lights, and lots of sing-along moments. Carry a light jacket; evenings can get breezy.",
    "image1": "/images/events/music-night-drive-one.png",
    "image2": "/images/events/music-night-drive-two.png",
    "image3": "/images/events/music-night-drive-three.png",
    "image4": "/images/events/music-night-drive-four.png",
    "location": "Amphi Theatre"
  },
  {
    "id": 17,
    "title": "Inter-Dept Sports League",
    "date": "2025-09-01",
    "startTime": "08:00",
    "endTime": "17:00",
    "category": "Sports",
    "department": "Physical Education",
    "venue": "Indoor Arena",
    "organizer": "PE Dept",
    "shortDescription": "Basketball and badminton fixtures through September.",
    "description": "Round-robin fixtures culminating in a finals weekend.",
    "longDescription": "A month-long league spanning basketball and badminton with fixtures scheduled on weekday afternoons and weekend mornings. Departments play round-robin to determine knockout seeds, ensuring multiple matches for each team. The arena will host skill clinics between games, open to all students. League tables and highlights will be posted weekly. Come support your department and track the race to the finals.",
    "image1": "/images/events/inter-dept-sports-one.png",
    "image2": "/images/events/inter-dept-sports-two.png",
    "image3": "/images/events/inter-dept-sports-three.png",
    "image4": "/images/events/inter-dept-sports-four.png",
    "location": "Indoor Arena"
  },
  {
    "id": 18,
    "title": "Workshop: Intro to Generative AI",
    "date": "2025-10-05",
    "startTime": "10:00",
    "endTime": "13:00",
    "category": "Academic",
    "department": "AI & DS",
    "venue": "Lab 210",
    "organizer": "AI & DS",
    "shortDescription": "Hands-on with prompts, safety, and evaluation.",
    "description": "Build your first GenAI app; best practices, guidelines and safety included.",
    "longDescription": "A fast-paced primer on generative AI covering text, image, and speech use cases. We’ll discuss prompt design, responsible use, and simple evaluation strategies. In the lab, you’ll stitch together a minimal prototype using open tools and learn how to iterate safely. The session ends with a mini-showcase of participant demos and a resource kit for continued practice. Suitable for beginners; bring a laptop.",
    "image1": "/images/events/workshop-intro-four.png",
    "image2": "/images/events/workshop-intro-three.png",
    "image3": "/images/events/workshop-intro-two.png",
    "image4": "/images/events/workshop-intro-one.png",
    "location": "Lab 210"
  },
  {
    "id": 19,
    "title": "Startup Talk",
    "date": "2025-10-25",
    "startTime": "15:00",
    "endTime": "17:00",
    "category": "Departmental",
    "department": "E-Cell",
    "venue": "Seminar Room 1",
    "organizer": "E-Cell",
    "shortDescription": "Founders share journey from campus to company.",
    "description": "From ideation to PMF — Q&A with founders and investors.",
    "longDescription": "A candid conversation with founders on validating ideas, surviving early pivots, and finding product-market fit. Expect practical advice on fundraising, hiring your first team members, and staying focused. The talk is followed by an extended Q&A and informal huddles where you can get feedback on your concept. Bring questions and, if you like, a one-pager of your idea.",
    "image1": "/images/events/startup-talk-drive-one.png",
    "image2": "/images/events/startup-talk-drive-two.png",
    "image3": "/images/events/startup-talk-drive-three.png",
    "image4": "/images/events/startup-talk-drive-four.png",
    "location": "Seminar Room 1"
  },
  {
    "id": 20,
    "title": "Cultural Parade",
    "date": "2025-08-12",
    "startTime": "16:00",
    "endTime": "19:00",
    "category": "Cultural",
    "department": "Arts",
    "venue": "Campus Boulevard",
    "organizer": "Arts Society",
    "shortDescription": "Costumes, dance troupes, and live music.",
    "description": "A vibrant celebration showcasing cultures from across the student body.",
    "longDescription": "A moving tapestry of colors and sound as student groups present floats, costumes, and choreographed routines along the boulevard. The parade route features three performance bays where troupes pause for short showcases and audience engagement. Bring flags, wear your colors, and join the closing circle where everyone is invited to dance. Marshals will guide the route and ensure safety; please follow instructions and keep pathways clear for performers.",
    "image1": "/images/events/culture-parade-one.png",
    "image2": "/images/events/culture-parade-two.png",
    "image3": "/images/events/culture-parade-three.png",
    "image4": "/images/events/culture-parade-four.png",
    "location": "Campus Boulevard"
  }
]
